result.log
Network Creating....
Build....
Start Server....
Initial Mem Usage
==========================================
fastapi-py310-normal: 85.88MiB / 7.75GiB
fastapi-py310-shared: 92.68MiB / 7.75GiB
==========================================
Run fastapi-py310-normal
==========================================
Run vegeta to Normal(300req/sec, 10sec)
Requests      [total, rate, throughput]         3000, 300.14, 300.03
Duration      [total, attack, wait]             9.999s, 9.995s, 3.836ms
Latencies     [min, mean, 50, 90, 95, 99, max]  2.964ms, 5.544ms, 3.212ms, 3.75ms, 4.604ms, 86.447ms, 190.049ms
Bytes In      [total, mean]                     75000, 25.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:
==========================================
Run fastapi-py310-shared
==========================================
Run vegeta to Shared(300req/sec, 10sec)
Requests      [total, rate, throughput]         3000, 300.15, 1.09
Duration      [total, attack, wait]             32.109s, 9.995s, 22.114s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.139ms, 4.87s, 1.684ms, 30s, 30.001s, 30.001s, 30.01s
Bytes In      [total, mean]                     47955, 15.98
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           1.17%
Status Codes  [code:count]                      0:465  200:35  503:2500  
Error Set:
503 Service Unavailable
Get "http://fastapi-py310-shared:5000/": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
After Requests Mem Usage
==========================================
fastapi-py310-normal: 165.5MiB / 7.75GiB
fastapi-py310-shared: 756.2MiB / 7.75GiB
lrwx------ 1 apl apl 64 Oct  6 10:35 5 -> /dev/shm/sm_tokens (deleted)
lrwx------ 1 apl apl 64 Oct  6 10:35 7 -> /dev/shm/sm_tokens (deleted)
lrwx------ 1 apl apl 64 Oct  6 10:35 5 -> /dev/shm/sm_tokens
lrwx------ 1 apl apl 64 Oct  6 10:35 7 -> /dev/shm/sm_tokens
lrwx------ 1 apl apl 64 Oct  6 10:35 5 -> /dev/shm/sm_tokens
lrwx------ 1 apl apl 64 Oct  6 10:35 7 -> /dev/shm/sm_tokens
lrwx------ 1 apl apl 64 Oct  6 10:35 5 -> /dev/shm/sm_tokens (deleted)
lrwx------ 1 apl apl 64 Oct  6 10:35 7 -> /dev/shm/sm_tokens (deleted)
lrwx------ 1 apl apl 64 Oct  6 10:35 5 -> /dev/shm/sm_tokens (deleted)
lrwx------ 1 apl apl 64 Oct  6 10:35 7 -> /dev/shm/sm_tokens (deleted)
lrwx------ 1 apl apl 64 Oct  6 10:35 5 -> /dev/shm/sm_tokens (deleted)
lrwx------ 1 apl apl 64 Oct  6 10:35 7 -> /dev/shm/sm_tokens (deleted)
==========================================
=[LOG] Processed successfully(Normal)=====
PID: 114, OutputLogs: 694
PID: 115, OutputLogs: 80
PID: 116, OutputLogs: 710
PID: 117, OutputLogs: 364
PID: 118, OutputLogs: 540
PID: 136, OutputLogs: 602
PID: 137, OutputLogs: 10
PID: 150, OutputLogs: 0
PID: 151, OutputLogs: 0
=[LOG] Exceeded concurrency limit(Normal)=
PID: 114, OutputLogs: 0
PID: 115, OutputLogs: 0
PID: 116, OutputLogs: 0
PID: 117, OutputLogs: 0
PID: 118, OutputLogs: 0
PID: 136, OutputLogs: 0
PID: 137, OutputLogs: 0
PID: 150, OutputLogs: 0
PID: 151, OutputLogs: 0
=[LOG] Shutting down(Normal)==============
PID: 114, OutputLogs: 1
PID: 115, OutputLogs: 0
PID: 116, OutputLogs: 1
PID: 117, OutputLogs: 0
PID: 118, OutputLogs: 1
PID: 136, OutputLogs: 1
PID: 137, OutputLogs: 0
PID: 150, OutputLogs: 0
PID: 151, OutputLogs: 0
=[LOG] Processed successfully(Shared)=====
PID: 115, OutputLogs: 6
PID: 116, OutputLogs: 9
PID: 117, OutputLogs: 13
PID: 118, OutputLogs: 13
PID: 119, OutputLogs: 17
PID: 320, OutputLogs: 0
PID: 321, OutputLogs: 0
PID: 322, OutputLogs: 0
=[LOG] Exceeded concurrency limit(Shared)=
PID: 115, OutputLogs: 329
PID: 116, OutputLogs: 407
PID: 117, OutputLogs: 666
PID: 118, OutputLogs: 546
PID: 119, OutputLogs: 552
PID: 320, OutputLogs: 0
PID: 321, OutputLogs: 0
PID: 322, OutputLogs: 0
=[LOG] Shutting down(Shared)==============
PID: 115, OutputLogs: 0
PID: 116, OutputLogs: 0
PID: 117, OutputLogs: 1
PID: 118, OutputLogs: 1
PID: 119, OutputLogs: 1
PID: 320, OutputLogs: 0
PID: 321, OutputLogs: 0
PID: 322, OutputLogs: 0
=[LOG] Cached Memory(Shared)==============
[2022-10-06 10:35:11 +0000] [115] [INFO] |thread=281473090974176| Extend Shared Memory Object Mapping Size for WRITE. 15155 => 2003687
[2022-10-06 10:35:11 +0000] [115] [INFO] |thread=281473090974176| Extend Done for WRITE
[2022-10-06 10:35:11 +0000] [116] [INFO] |thread=281473090974176| Extend Shared Memory Object Mapping Size for READ. 15155 => 2003687
[2022-10-06 10:35:11 +0000] [116] [INFO] |thread=281473090974176| Extend Done for READ
[2022-10-06 10:35:11 +0000] [117] [INFO] |thread=281473090974176| Extend Shared Memory Object Mapping Size for READ. 15155 => 2003687
[2022-10-06 10:35:11 +0000] [117] [INFO] |thread=281473090974176| Extend Done for READ
[2022-10-06 10:35:11 +0000] [119] [INFO] |thread=281473090974176| Extend Shared Memory Object Mapping Size for READ. 15155 => 2003687
[2022-10-06 10:35:11 +0000] [119] [INFO] |thread=281473090974176| Extend Done for READ
[2022-10-06 10:35:11 +0000] [118] [INFO] |thread=281473090974176| Extend Shared Memory Object Mapping Size for READ. 15155 => 2003687
[2022-10-06 10:35:11 +0000] [118] [INFO] |thread=281473090974176| Extend Done for READ
[2022-10-06 10:35:12 +0000] [119] [INFO] |thread=281471512191456| Extend Shared Memory Object Mapping Size for WRITE. 2003687 => 4005323
[2022-10-06 10:35:12 +0000] [119] [INFO] |thread=281471512191456| Extend Done for WRITE
[2022-10-06 10:35:12 +0000] [117] [INFO] |thread=281472057455072| Extend Shared Memory Object Mapping Size for READ. 2003687 => 4005323
[2022-10-06 10:35:12 +0000] [117] [INFO] |thread=281472057455072| Extend Done for READ
[2022-10-06 10:35:12 +0000] [115] [INFO] |thread=281473064178144| Extend Shared Memory Object Mapping Size for READ. 2003687 => 4005323
[2022-10-06 10:35:12 +0000] [115] [INFO] |thread=281473064178144| Extend Done for READ
[2022-10-06 10:35:12 +0000] [118] [INFO] |thread=281473074577888| Extend Shared Memory Object Mapping Size for READ. 2003687 => 4005323
[2022-10-06 10:35:12 +0000] [118] [INFO] |thread=281473074577888| Extend Done for READ
[2022-10-06 10:35:13 +0000] [116] [INFO] |thread=281473066185184| Extend Shared Memory Object Mapping Size for READ. 2003687 => 4005323
[2022-10-06 10:35:13 +0000] [116] [INFO] |thread=281473066185184| Extend Done for READ
==========================================
Cleanup....
==========================================